{
  "question": "What methodology was used?",
  "hits": [
    {
      "index": 24,
      "score": 0.26898091956031706,
      "text": "n, Scim uses a pretrained lan-\nguage model [ 99 ] to classify salient sentences within papers into\none of four information facets: research objectives, novel aspects\nof the research, methodology, and results, coupled with heuristics\nthat ensure an even distribution of highlights. Usability studies\nof Scim have shown these highlights can reduce the time it takes\nreaders to find specific information within a paper. Readers found\nScim particularly useful when skimming text-dense papers, or for\npapers that fell outside their area of expertise. Moreover, readers\nlearned to use both Scim’s inline highlights and a sidebar summary\nof highlights to augment their existing reading strategies.",
      "metadata": {
        "doc_id": "2303.14334v2-embedded",
        "title": "Page 4",
        "page": 8,
        "images": []
      }
    },
    {
      "index": 42,
      "score": 0.2272311056526085,
      "text": "( e.g., threads of prior work instead of tables [ 13 , 58 ]), and research\npaper discovery ( e.g., based on inline citations in clipped text).\nFor this, Threddy [ 43 ] is a thread-focused clipping tool integrated\ninto scholars’ paper reading process to support literature review\nand discovery. Using Threddy, readers can select and save sentences\ninto a sidebar from the related work sections of a paper. The sys-\ntem maintains rich context for each clip, including its provenance\nand inline citations. This allows readers to navigate back to the\nclipped paper and cited papers afterward. In the sidebar, readers\ncan further organize clips collected across papers into a hierarchy\nof threads to form their view of the research landscape. The content\nof the sidebar is preserved across papers that were read over time,\nand provides valuable context for subsequent reading based on\nthe emerging threads of research the reader have curated. Finally,\nreaders can further expand their coverage by exploring paper rec-\nommendations for each thread, based on the referenced papers in\nthe corresponding clips. A lab study showed that Threddy was able\nto lower the interaction costs of saving clips while main",
      "metadata": {
        "doc_id": "2303.14334v2-embedded",
        "title": "Page 7",
        "page": 11,
        "images": []
      }
    },
    {
      "index": 84,
      "score": 0.22613509693432793,
      "text": "oned by OCLC\nResearch. Published online at: www. oclc. org/programs/publications/reports/2009-\n02. pdf (2009).\n[75] Soya Park, Jonathan Bragg, Michael Chang, Kevin Larson, and Danielle Bragg.\n2022. Exploring Team-Sourced Hyperlinks to Address Navigation Challenges\nfor Low-Vision Readers of Scientific Papers. In Proceedings of the 25th ACM\nConference On Computer-Supported Cooperative Work And Social Computing .\n[76] Amy Pavel, Colorado Reed, Björn Hartmann, and Maneesh Agrawala. 2014.\nVideo digests: a browsable, skimmable format for informational lecture videos.\nProceedings of the 27th annual ACM symposium on User interface software and\ntechnology (2014).\n[77] Silvio Peroni, Alexander Dutton, Tanya Gray, and David M. Shotton. 2015.\nSetting our bibliographic references free: towards open citation data. J. Docu-\nmentation 71 (2015), 253–277.\n[78] Simon Philip, Peter Bamidele Shola, and Abari Ovye John. 2014. Application\nof Content-Based Approach in Research Paper Recommendation System for\na Digital Library. International Journal of Advanced Computer Science and\nApplications 5 (2014).\n[79] Peter Pirolli and Stuart Card. 1999. Information Foraging. Psychological Review\n106, 4 (1999), 64",
      "metadata": {
        "doc_id": "2303.14334v2-embedded",
        "title": "Page 10",
        "page": 14,
        "images": []
      }
    },
    {
      "index": 43,
      "score": 0.22498799193607477,
      "text": "g paper rec-\nommendations for each thread, based on the referenced papers in\nthe corresponding clips. A lab study showed that Threddy was able\nto lower the interaction costs of saving clips while maintaining\ncontext, allowed participants to curate research threads without\nbreaking reading flows, and discover interesting new papers to\nfurther grow their understanding of the research fields.",
      "metadata": {
        "doc_id": "2303.14334v2-embedded",
        "title": "Page 7",
        "page": 11,
        "images": []
      }
    },
    {
      "index": 39,
      "score": 0.2240710742174033,
      "text": "iews of fast-paced domains. The Threddy [ 43 ] and\nRelated [ 73 ] projects explored this opportunity using two different\napproaches: clipping and organizing research threads mentioned\nacross papers [ 43 ], and directly exploring and reading related work\nsections extracted across many papers [73].",
      "metadata": {
        "doc_id": "2303.14334v2-embedded",
        "title": "Page 6",
        "page": 10,
        "images": []
      }
    }
  ]
}